In [49]:
import pandas as pd
data = {
    'EmployeeID': [101, 102, 103, 104, 105,106],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma','Wiebe'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales','IT'],
    'Salary': [55000, 75000, 80000, 70000, 65000, 80000]
}
employees = pd.DataFrame(data)
employees

   EmployeeID     Name Department  Salary
0         101    Alice         HR   55000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000
3         104    David  Marketing   70000
4         105     Emma      Sales   65000
5         106    Wiebe         IT   80000

In [50]:
print("First 3 rows of eployeees")
# print(employees.head(3))
employees.head(3)

First 3 rows of eployeees

   EmployeeID     Name Department  Salary
0         101    Alice         HR   55000
1         102      Bob         IT   75000
2         103  Charlie    Finance   80000

In [51]:
print("Check summary statistics for Salary")
employees.describe()['Salary']

Check summary statistics for Salary

count        6.000000
mean     70833.333333
std       9703.951085
min      55000.000000
25%      66250.000000
50%      72500.000000
75%      78750.000000
max      80000.000000
Name: Salary, dtype: float64

In [52]:
print("Number of employees in each department")
employees.groupby('Department')['EmployeeID'].count()

Number of employees in each department

Department
Finance      1
HR           1
IT           2
Marketing    1
Sales        1
Name: EmployeeID, dtype: int64

In [53]:
print("Average salary: ")
average_salary = employees['Salary'].mean()
average_salary

Average salary:

70833.33333333333

In [54]:
highest_salary = employees['Salary'].max()
print("Employee with highest salary:")
highest_avg_sal = employees[employees['Salary']==highest_salary]
highest_avg_sal

Employee with highest salary:

   EmployeeID     Name Department  Salary
2         103  Charlie    Finance   80000
5         106    Wiebe         IT   80000

In [55]:
lowest_salary = employees['Salary'].min()
print("Employee with highest salary:")
lowest_avg_sal = employees[employees['Salary']==lowest_salary]
lowest_avg_sal

Employee with highest salary:

   EmployeeID   Name Department  Salary
0         101  Alice         HR   55000

In [56]:
employees['Salary Increase'] = employees['Salary'] *1.1
print("Dataframe with 'Salary increse' column: ")
employees

Dataframe with 'Salary increse' column:

   EmployeeID     Name Department  Salary  Salary Increase
0         101    Alice         HR   55000          60500.0
1         102      Bob         IT   75000          82500.0
2         103  Charlie    Finance   80000          88000.0
3         104    David  Marketing   70000          77000.0
4         105     Emma      Sales   65000          71500.0
5         106    Wiebe         IT   80000          88000.0